Tekla.Structures.Plugins.CustomPartPositioningTypeAttribute
The CustomPartInputTypeAttribute class is used for defining the input type.
Based on the type the system will then position the custom part either based on calculated
extrema center point or given input points.
The attribute is initialized from the custom attribute i.e.
[CustomPartPositioningType((CustomPartBase.CustomPartPositioningType.POSITIONING_BY_INPUTPOINTS)]
in the custom part source code.

Tekla.Structures.Plugins.CustomPartPositioningTypeAttribute.#ctor(Tekla.Structures.Plugins.CustomPartBase.CustomPartPositioningType)
The custom attribute uses this to store the positioning type to the system.
This is not to be used by itself.
Type: The custom part positioning type.

Tekla.Structures.Plugins.CustomPartPositioningTypeAttribute.Type
The custom attribute uses this to store the positioning type to the system.
This is not to be used by itself.

Tekla.Structures.Plugins.CustomPartPositioningTypeAttribute.#ctor(System.Int32)
The custom attribute uses this to store the positioning type to the system.
This is not to be used by itself.
Type: The custom part positioning type.